"""
## 分类任务API - KNN
# 1 导入依赖包
# 2 准备数据 # 0 - 喜剧片 1 - 动作片 2 - 爱情片
# 3 实例化模型
# 4 模型训练
# 5 模型预测

x = [[39, 0, 31],
     [3, 2, 65],
     [2, 3, 55],
     [9, 38, 2],
     [8, 34, 17],
     [5, 2, 57],
     [21, 17, 5],
     [45, 2, 9]]

y = [0, 1, 2, 2, 2, 1, 0, 0]

"""
# 1 导入依赖包
from sklearn.neighbors import KNeighborsClassifier

def dm02_KNN_demo():
    # 2 准备数据 # 0 - 喜剧片 1 - 动作片 2 - 爱情片
    x = [[39, 0, 31],
         [3, 2, 65],
         [2, 3, 55],
         [9, 38, 2],
         [8, 34, 17],
         [5, 2, 57],
         [21, 17, 5],
         [45, 2, 9]]

    y = [0, 1, 2, 2, 2, 1, 0, 0]
    # 3 实例化模型
    knn_cls = KNeighborsClassifier(n_neighbors=3)
    # 4 模型训练
    knn_cls.fit(x, y)
    # 5 模型预测
    print(f'预测类别: {knn_cls.predict([[23, 3, 17]])}')


if __name__ == '__main__':
    dm02_KNN_demo()